# Pandas and numpy intro

This will be a quick intro

In [3]:
import numpy as np
import pandas as pd

In [31]:
new_x = pd.Series(np.zeros(5), index=['a','b','c','d','e'])
new_x

a    0.0
b    0.0
c    0.0
d    0.0
e    0.0
dtype: float64

In [32]:
np.isnan(new_x)

a    False
b    False
c    False
d    False
e    False
dtype: bool

In [35]:
data= pd.DataFrame(np.eye(5,5))
data

     0    1    2    3    4
0  1.0  0.0  0.0  0.0  0.0
1  0.0  1.0  0.0  0.0  0.0
2  0.0  0.0  1.0  0.0  0.0
3  0.0  0.0  0.0  1.0  0.0
4  0.0  0.0  0.0  0.0  1.0

In [36]:
data1 =[['a', 10], ['b',20],['c',30]]

In [40]:
df2=pd.DataFrame(data1,columns=['Name','Score'])
df2

  Name  Score
0    a     10
1    b     20
2    c     30

In [41]:
user_details = pd.read_csv('../user_details.csv')
user_details

       Title  firstName      lastName  gender                          email
0  Honorable   Alasdair        Beeckx    Male                abeeckx0@un.org
1         Dr    Saunder       Murname    Male              smurname1@ftc.gov
2  Honorable    Julissa      Spriddle  Female  jspriddle2@chicagotribune.com
3        Rev  Bernadene          Peak  Female                 bpeak3@fc2.com
4        Mrs       Cass  Bernardeschi    Male  cbernardeschi4@technorati.com
5  Honorable       Aggi        Lipson  Female               alipson5@ucoz.ru
6         Ms    Trescha        Damato  Female           tdamato6@skyrock.com
7         Dr        Dav        Headon    Male               dheadon7@ted.com
8  Honorable    Nealson       Janeway    Male               njaneway8@360.cn
9        Mrs      Laney        Trobey  Female        ltrobey9@eventbrite.com

In [43]:
user_details[user_details['gender']== 'Male']

       Title firstName      lastName gender                          email
0  Honorable  Alasdair        Beeckx   Male                abeeckx0@un.org
1         Dr   Saunder       Murname   Male              smurname1@ftc.gov
4        Mrs      Cass  Bernardeschi   Male  cbernardeschi4@technorati.com
7         Dr       Dav        Headon   Male               dheadon7@ted.com
8  Honorable   Nealson       Janeway   Male               njaneway8@360.cn

In [47]:
user_details.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [56]:
user_details['Title']

0    Honorable
1           Dr
2    Honorable
3          Rev
4          Mrs
5    Honorable
6           Ms
7           Dr
8    Honorable
9          Mrs
Name: Title, dtype: object